app/Controllers/Usuario.php

    public function index(){

        return view('usuarios', [
            'usuarios' => $this->UserModel->findAll()
        ]);
---
SELECT *
FROM `usuarios`